#!/usr/bin/python3
from student import *
from funcs import *

grp_arr = {
    ("Петров","Иван","Михайлович"):
    {'дата рождения':1993, 'рост':185,
     'дисциплины':{'информатика':5,'математика':4,'английский язык':4, 'экономика':4,
                 'физика' : 4}},
    ("Андреев","Петр","Владиславович"):
    {'дата рождения':1997, 'рост':177,
     'дисциплины':{'информатика':5,'математика':5,'английский язык':5, 'экономика':5,
                 'физика' : 4}},
    ("Евгеньев","Артем","Александрович"):
    {'дата рождения':1992, 'рост':182,
     'дисциплины':{'информатика':4,'математика':3.5,'английский язык':5, 'экономика':5,
                 'физика' : 4}},
    ("Артемова","Виктория","Мирославовна"):
    {'дата рождения':1991, 'рост':174,
     'дисциплины':{'информатика':3.5,'математика':3.2,'английский язык':5, 'экономика':4,
                 'физика' : 3}},
}


students = students_fromdict(grp_arr)
print("===ДО===")
for i in students:
    print(i)
    print(students[i].list_disciplines())
    print("---")
students_study(students)
print("===ПОСЛЕ УЧЕБЫ===")
for i in students:
    print(i)
    print(students[i].list_disciplines())
    print("---")
print("===ПОСЛЕ ОТДЫХА===")
students_rest(students)
for i in students:
    print(i)
    print(students[i].list_disciplines())
    print("---")
