#!/usr/bin/python3

grp_arr = {
    ("Петров","Иван","М."):
    {'дата рождения':1993,'информатика':5,'математика':4,'английский язык':4},
    ("Андреев","Петр","В."):
    {'дата рождения':1997,'информатика':5,'математика':5,'английский язык':5},
    ("Евгеньев","Артем","А."):
    {'дата рождения':1992,'информатика':4,'математика':3,'английский язык':5},
    ("Артемова","Виктория","М."):
    {'дата рождения':1991,'информатика':3,'математика':3,'английский язык':5},
}
        

# самый молодой студент (словарь)

year = int(input("Введите год рождения: "))
matched = None

for i in grp_arr:
    if year == grp_arr[i]['дата рождения']:
        matched = i
if matched != None:
    print(matched[1] + ' ' + matched[0] + ' ' + matched[2] + ' родился в ' + str(year))
else:
    print("Студента с таким годом рождения нет.")
