#!/usr/bin/python3
from student import *
from funcs import *

grp_arr = {
    ("Петров","Иван","Михайлович"):
    {'дата рождения':1993, 'рост':185,
     'предметы':{'информатика':5,'математика':4,'английский язык':4, 'экономика':4,
                 'физика' : 4}},
    ("Андреев","Петр","Владиславович"):
    {'дата рождения':1997, 'рост':177,
     'предметы':{'информатика':5,'математика':5,'английский язык':5, 'экономика':5,
                 'физика' : 4}},
    ("Евгеньев","Артем","Александрович"):
    {'дата рождения':1992, 'рост':182,
     'предметы':{'информатика':4,'математика':3,'английский язык':5, 'экономика':5,
                 'физика' : 4}},
    ("Артемова","Виктория","Мирославовна"):
    {'дата рождения':1991, 'рост':174,
     'предметы':{'информатика':3,'математика':3,'английский язык':5, 'экономика':4,
                 'физика' : 3}},
}


students = create_student_dict(grp_arr)

print("Созданный словарь из классов: ")
print(students)
print("---")

#

print("Строгий поиск по \"Виктория\"")
a = students_search_firstname(students,"Виктория")
print(a)

print("Строгий поиск по \"Виктря\"")
a = students_search_firstname(students,"Виктря")
print(a)

print("Нечеткий Поиск по \"Виктря\"")
a = students_tryfind_firstname(students,"Виктря")
print(a)
print("---")

print("Строгий поиск по высоте:185")
a = students_search_height(students,185)
print(a)
print("---")

print("Нечеткий поиск по высоте:185+-5")
a = students_tryfind_height(students,185)
print(a)
print("---")
