#!/usr/bin/python3

from string_functions import *
from my_search import *
list_arr= [
    ["Иван Петров М.", 1993, 5, 4, 4],
    ["Петр Андреев В.", 1997, 5, 5, 5],
    ["Артем Евгеньев А.", 1992, 4, 3, 5],
    ["Виктория Артемова М.", 1991, 3, 3, 5]
]

grp_arr = {
    ("Петров","Иван","М."):
    {'дата рождения':1993,'информатика':5,'математика':4,'английский язык':4},
    ("Андреев","Петр","В."):
    {'дата рождения':1997,'информатика':5,'математика':5,'английский язык':5},
    ("Евгеньев","Артем","А."):
    {'дата рождения':1992,'информатика':4,'математика':3,'английский язык':5},
    ("Артемова","Виктория","М."):
    {'дата рождения':1991,'информатика':3,'математика':3,'английский язык':5},
}

print("Поиск по \"Андреев\"")
c = my_search(grp_arr,"Андреев")
print(c)
print("Поиск по \"Иван\"")
c = my_search(grp_arr,"Иван")
print(c)
print("Поиск по \"George\"")
c = my_search(grp_arr,"George")
print(c)
print("---")
print("Сравнение элеметов между собой:")
c = my_compare(list_arr,list_arr[1])
print(c)
print("---")
с = my_compare(grp_arr,list_arr[1])
print(c)
print("---")
c = my_compare(grp_arr,("Артемова","Виктория","М."));
print(c)
